import math #подключаю библиотеку math для матиматических операций 
length = float(input("пожалуйста введите радиус круга в см: "))# Вежливо прошу ввести значение радиуса
#вычисляю длину окр. спомошью формулы 2ПR, где R- length
print(f" {2*3.14* length}(см)- длина окружности ")       
print(f" {( 2*3.14* length)/100}(м) - длина окружности ")
#вычисляю площадь круга спомошью формулы ПR**2, где R- length
print(f"{3.14* length**2}(см) - площадь круга")
print(f"{(3.14* length**2)/100}(м) - площадь круга")
#вычисляю сторону вписанного в окружность квадрата через формулу R*2**1/2
print(f"{length*math.sqrt(2)}(см) - сторона вписанного в окружность квадрата ")
print(f"{(length*math.sqrt(2))/100}(м) - сторона вписанного в окружность квадрата ")
#вычисляю сторону равностороннего треугольника через формулу r*3**1/2
print(f"{length*math.sqrt(3)}(см) - сторона равностороннего треугольника")
print(f"{(length*math.sqrt(3))/100}(м) - сторона равностороннего треугольника")
#вычисляю сторону квадрата, где а=2r. 
print(f"{length*2}(см) - сторона квадрата")
print(f"{(length*2)/100}(м) - сторона квадрата")
#вычисляю сторону равностороннего треугольника, а= sqrt(3)
print(f"{2*math.sqrt(3)*length}(см) - сторона равностороннего треугольника")
print(f"{(2*math.sqrt(3)*length)/100}(м)- сторона равностороннего треугольника")
#вычисляю сторону восьмиугольника, а= 2(\sqrt{2}-1r\ )
print(f"{(2*math.sqrt(2)-1)*length}(см) - сторона шестиугольника")
print(f"{((2*math.sqrt(2)-1)*length)/100}(м) - сторона шестиугольника")



